abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
static const uint8_t patable_power_315[] = {0x17,0x1D,0x26,0x69,0x51,0x86,0xCC,0xC3};
static const uint8_t patable_power_433[] = {0x6C,0x1C,0x06,0x3A,0x51,0x85,0xC8,0xC0};
static const uint8_t patable_power_868[] = {0x03,0x17,0x1D,0x26,0x50,0x86,0xCD,0xC0};
static const uint8_t patable_power_915[] = {0x0B,0x1B,0x6D,0x67,0x50,0x85,0xC9,0xC1};
//static uint8_t patable_power_2430[] = {0x44,0x84,0x46,0x55,0xC6,0x6E,0x9A,0xFE};

//----------------------------------[END]---------------------------------------

//-------------------------[CC1101 cc1101_reset function]------------------------------
void cc1101_reset(void)                  // cc1101_reset defined in CC1101 datasheet
{
    SPI_CS_ACTIVE();
    delay_us(10);
    SPI_CS_IDLE();
    delay_us(40);

    cc1101_spi_write_strobe(SRES);
    delay_ms(1);
}
//-----------------------------[END]--------------------------------------------

//------------------------[set Power Down]--------------------------------------
void cc1101_powerdown(void)
{
    cc1101_sidle();
    cc1101_spi_write_strobe(SPWD);               // CC1101 Power Down
}
//-----------------------------[end]--------------------------------------------

/*
//---------------------------[WakeUp]-------------------------------------------
void cc1101_wakeup(void)
{
    SPI_CS_ACTIVE();
    delay_us(10);
    SPI_CS_IDLE();
    delay_us(10);
    cc1101_receive();                            // go to RX Mode
}

//-----------------------------[end]--------------------------------------------
*/

//---------------------[CC1101 set debug level]---------------------------------
uint8_t cc1101_set_debug_level(uint8_t cc1101_set_debug_level)  //default OFF
{
    cc1101_debug_level = cc1101_set_debug_level;        //set debug level of CC1101 outputs

    return cc1101_debug_level;
}
//-----------------------------[end]--------------------------------------------

//---------------------[CC1101 get debug level]---------------------------------
uint8_t cc1101_get_debug_level(void)
{
    return cc1101_debug_level;
}
//-----------------------------[end]--------------------------------------------

//----------------------[CC1101 init functions]---------------------------------
uint8_t cc1101_begin(uint8_t *My_addr)
{
    uint8_t CC1101_freq_select, CC1101_mode_select, CC1101_channel_select;
    uint8_t partnum, version;

    cc1101_GDO_set();                            //setup AVR GPIO ports

    cc1101_set_debug_level(cc1101_set_debug_level(1));   //set debug level of CC1101 outputs

    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {
        uart_println("Init CC1101...");
    }
    #endif

    cc1101_spi_begin();                          //inits SPI Interface
    cc1101_reset();                              //CC1101 init cc1101_reset

    cc1101_spi_write_strobe(SFTX);delay_us(100);//flush the TX_fifo content
    cc1101_spi_write_strobe(SFRX);delay_us(100);//flush the RX_fifo content

    partnum = cc1101_spi_read_register(PARTNUM); //reads CC1101 partnumber
    version = cc1101_spi_read_register(VERSION); //reads CC1101 version number

    //checks if valid Chip ID is found. Usualy 0x03 or 0x14. if not -> abort
    if(version == 0x00 || version == 0xFF)
    {
        #if MINIMAL_MODE == 0
        if(cc1101_debug_level > 0)
        {
            uart_print("no CC11xx found!");
            uart_println("");
        }
        #endif
        return FALSE;
    }

    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {
        uart_print("Partnumber:");
        cc1101_uart_puthex_byte(partnum);
        uart_println("");

        uart_print("Version:");
        cc1101_uart_puthex_byte(version);
        uart_println("");
    }
    #endif

    //default settings
    //*My_addr = 0x00;
    CC1101_freq_select = 0x02;    //433.92MHz
    CC1101_mode_select = 0x01;    //gfsk 1.2kbps
    CC1101_channel_select = 0x01;


    //set modulation mode
    cc1101_set_mode(CC1101_mode_select);

    //set ISM band
    cc1101_set_ISM(CC1101_freq_select);

    //set channel
    cc1101_set_channel(CC1101_channel_select);

    //set output power amplifier
    cc1101_set_output_power_level(0);            //set PA to 0dBm as default

    //set my receiver address
    cc1101_set_myaddr(*My_addr);                  //set addr

    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {
        uart_println("...done");
    }
    #endif

    cc1101_receive();                            //set CC1101 in cc1101_receive mode

    return TRUE;
}
//-------------------------------[end]------------------------------------------

//-----------------[finish's the CC1101 operation]------------------------------
void cc1101_end(void)
{
    cc1101_powerdown();                          //power down CC1101
    cc1101_spi_end();                            //disable SPI Interface (Does nothing for MSP430)
}
//-------------------------------[end]------------------------------------------

//-----------------------[show all CC1101 registers]----------------------------
void cc1101_show_register_settings(void)
{
    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {
        uint8_t config_reg_verify[CFG_REGISTER],Patable_verify[CFG_REGISTER];

        cc1101_spi_read_burst(READ_BURST,config_reg_verify,CFG_REGISTER);  //reads all 47 config register
        cc1101_spi_read_burst(PATABLE_BURST,Patable_verify,8);             //reads output power settings
        uart_println("Cfg_reg:");

        for(uint8_t i = 0 ; i < CFG_REGISTER; i++)  //showes rx_buffer for debug
            {
                cc1101_uart_puthex_byte(config_reg_verify[i]);uart_print(" ");
                if(i == 9 || i == 19 || i == 29 || i == 39) //just for beautiful output style
                    {
                        uart_println("");
                    }
            }
            uart_println("");
            uart_println("PaTable:");

            for(uint8_t i = 0 ; i < 8; i++)         //showes rx_buffer for debug
                {
                    cc1101_uart_puthex_byte(Patable_verify[i]);uart_print(" ");
                }
        uart_println("");
    }
    #endif
}
//-------------------------------[end]------------------------------------------


//----------------------------[idle mode]---------------------------------------
uint8_t cc1101_sidle(void)
{
    uint8_t marcstate;

    cc1101_spi_write_strobe(SIDLE);              //sets to idle first. must be in

    marcstate = 0xFF;                     //set unknown/dummy state value

    while(marcstate != 0x01)              //0x01 = cc1101_sidle
    {
        marcstate = (cc1101_spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in RX
        //cc1101_uart_puthex_byte(marcstate);
    }
    //uart_println("");
    delay_us(100);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//---------------------------[cc1101_transmit mode]------------------------------------
uint8_t cc1101_transmit(void)
{
    uint8_t marcstate;

    cc1101_sidle();                              //sets to idle first.
    cc1101_spi_write_strobe(STX);                //sends the data over air

    marcstate = 0xFF;                     //set unknown/dummy state value

    while(marcstate != 0x01)              //0x01 = ILDE after sending data
    {
        marcstate = (cc1101_spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in IDLE and TX is finished
        //cc1101_uart_puthex_byte(marcstate);
    }
    //uart_println("");
    delay_us(100);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

