abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
//---------------------------[cc1101_receive mode]-------------------------------------
uint8_t cc1101_receive(void)
{
    uint8_t marcstate;

    cc1101_sidle();                              //sets to idle first.
    cc1101_spi_write_strobe(SRX);                //writes cc1101_receive strobe (cc1101_receive mode)

    marcstate = 0xFF;                     //set unknown/dummy state value

    while(marcstate != 0x0D)              //0x0D = RX
    {
        marcstate = (cc1101_spi_read_register(MARCSTATE) & 0x1F); //read out state of CC1101 to be sure in RX
        //cc1101_uart_puthex_byte(marcstate);
    }
    //uart_println("");
    delay_us(100);
    return TRUE;
}
//-------------------------------[end]------------------------------------------

//------------[enables WOR Mode  EVENT0 ~1890ms; rx_timeout ~235ms]--------------------
void cc1101_wor_enable()
{
/*
    EVENT1 = WORCTRL[6:4] -> Datasheet page 88
    EVENT0 = (750/Xtal)*(WOREVT1<<8+WOREVT0)*2^(5*WOR_RES) = (750/26Meg)*65407*2^(5*0) = 1.89s

                        (WOR_RES=0;RX_TIME=0)               -> Datasheet page 80
i.E RX_TIMEOUT = EVENT0*       (3.6038)      *26/26Meg = 235.8ms
                        (WOR_RES=0;RX_TIME=1)               -> Datasheet page 80
i.E.RX_TIMEOUT = EVENT0*       (1.8029)      *26/26Meg = 117.9ms
*/
    cc1101_sidle();

    cc1101_spi_write_register(MCSM0, 0x18);    //FS Autocalibration
    cc1101_spi_write_register(MCSM2, 0x01);    //MCSM2.RX_TIME = 1b

    // configure EVENT0 time
    cc1101_spi_write_register(WOREVT1, 0xFF);  //High byte Event0 timeout
    cc1101_spi_write_register(WOREVT0, 0x7F);  //Low byte Event0 timeout

    // configure EVENT1 time
    cc1101_spi_write_register(WORCTRL, 0x78);  //WOR_RES=0b; tEVENT1=0111b=48d -> 48*(750/26MHz)= 1.385ms

    cc1101_spi_write_strobe(SFRX);             //flush RX buffer
    cc1101_spi_write_strobe(SWORRST);          //resets the WOR timer to the programmed Event 1
    cc1101_spi_write_strobe(SWOR);             //put the radio in WOR mode when CSn is released

    delay_us(100);
}
//-------------------------------[end]------------------------------------------

//------------------------[disable WOR Mode]-------------------------------------
void cc1101_wor_disable()
{
    cc1101_sidle();                            //exit WOR Mode
    cc1101_spi_write_register(MCSM2, 0x07);    //stay in RX. No RX timeout
}
//-------------------------------[end]------------------------------------------

//------------------------[resets WOR Timer]------------------------------------
void cc1101_wor_reset()
{
    cc1101_sidle();                            //go to IDLE
    cc1101_spi_write_register(MCSM2, 0x01);    //MCSM2.RX_TIME = 1b
    cc1101_spi_write_strobe(SFRX);             //flush RX buffer
    cc1101_spi_write_strobe(SWORRST);          //resets the WOR timer to the programmed Event 1
    cc1101_spi_write_strobe(SWOR);             //put the radio in WOR mode when CSn is released

    delay_us(100);
}
//-------------------------------[end]------------------------------------------

//-------------------------[cc1101_tx_payload_burst]-----------------------------------
uint8_t cc1101_tx_payload_burst(uint8_t my_addr, uint8_t rx_addr,
                              uint8_t *txbuffer, uint8_t length)
{
    txbuffer[0] = length - 1;
    txbuffer[1] = rx_addr;
    txbuffer[2] = my_addr;

    cc1101_spi_write_burst(TXFIFO_BURST, txbuffer, length); //writes TX_Buffer +1 because of pktlen must be also transfered

    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {
        uart_print("TX_FIFO:");
        for(uint8_t i = 0 ; i < length; i++)       //TX_fifo debug out
        {
            cc1101_uart_puthex_byte(txbuffer[i]);
        }
        uart_println("");
    }
    #endif
  return TRUE;
}
//-------------------------------[end]------------------------------------------

//------------------[cc1101_rx_payload_burst - package received]-----------------------
uint8_t cc1101_rx_payload_burst(uint8_t *rxbuffer, uint8_t *pktlen)
{
    uint8_t bytes_in_RXFIFO = 0;
    uint8_t res = 0;

    bytes_in_RXFIFO = cc1101_spi_read_register(RXBYTES);              //reads the number of bytes in RXFIFO

    if((bytes_in_RXFIFO & 0x7F) && !(bytes_in_RXFIFO & 0x80))  //if bytes in buffer and no RX Overflow
    {
        cc1101_spi_read_burst(RXFIFO_BURST, rxbuffer, bytes_in_RXFIFO);
        *pktlen = rxbuffer[0];
        res = TRUE;
    }
    else
    {
        #if MINIMAL_MODE == 0
        if(cc1101_debug_level > 0)
        {
            uart_print("no bytes in RX buffer or RX Overflow!: ");
            cc1101_uart_puti(bytes_in_RXFIFO);
        }
        #endif
        cc1101_sidle();                                                  //set to IDLE
        cc1101_spi_write_strobe(SFRX);delay_us(100);            //flush RX Buffer
        cc1101_receive();                                                //set to cc1101_receive mode
        res = FALSE;
    }

    return res;
}
//-------------------------------[end]------------------------------------------

//---------------------------[send packet]--------------------------------------
uint8_t cc1101_send_packet(uint8_t my_addr, uint8_t rx_addr, uint8_t *txbuffer,
                            uint8_t pktlen, uint8_t tx_retries)
{
    uint8_t pktlen_ack = 0;                                         //default package len for ACK
    uint8_t rxbuffer[FIFOBUFFER] = {0};
    uint8_t tx_retries_count = 0;
    uint8_t from_sender = 0;
    uint16_t ackWaitCounter = 0;

    if(pktlen > (FIFOBUFFER - 1))                               //FIFO overflow check
    {
        uart_println("ERROR: package size overflow\r\n");
        return FALSE;
    }

    do 
    {
        cc1101_tx_payload_burst(my_addr, rx_addr, txbuffer, pktlen);   //loads the data in CC1101 buffer
        cc1101_transmit();                                             //sends data over air
        cc1101_receive();                                              //cc1101_receive mode

