abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
        if(rx_addr == BROADCAST_ADDRESS)
        {                       
            //no wait acknowledge if send to broadcast address or tx_retries = 0
            return TRUE;                                        //successful send to BROADCAST_ADDRESS
        }

        while (ackWaitCounter < ACK_TIMEOUT )                   //wait for an acknowledge
        {
            if (cc1101_packet_available() == TRUE)                     //if RF package received check package acknowge
            {
                from_sender = rx_addr;                          //the original message sender address
                cc1101_rx_fifo_erase(rxbuffer);                        //erase RX software buffer
                cc1101_rx_payload_burst(rxbuffer, &pktlen_ack);         //reads package in buffer
                cc1101_check_acknowledge(rxbuffer, pktlen_ack, from_sender, my_addr); //check if received message is an acknowledge from client
                return TRUE;                                    //package successfully send
            }
            else
            {
                ackWaitCounter++;                               //increment ACK wait counter
                delay_ms(1);                                    //delay_ms to give receiver time
            }
        }

        ackWaitCounter = 0;                                     //resets the ACK_Timeout
        tx_retries_count++;                                     //increase tx retry counter

        #if MINIMAL_MODE == 0
        if(cc1101_debug_level > 0)
        {                                    //debug output messages
            uart_print(" #:");
            cc1101_uart_puthex_byte(tx_retries_count-1);
            uart_println("");
        }
        #endif
    }	
    while(tx_retries_count <= tx_retries);                     //while count of retries is reaches

    return FALSE;                                              //send failed. too many retries
}
//-------------------------------[end]------------------------------------------

//--------------------------[send ACKNOWLEDGE]------------------------------------
void cc1101_send_acknowledge(uint8_t my_addr, uint8_t tx_addr)
{
    uint8_t pktlen = 0x06;                                      //complete Pktlen for ACK packet
    uint8_t tx_buffer[0x06];                                    //tx buffer array init

    tx_buffer[3] = 'A'; tx_buffer[4] = 'c'; tx_buffer[5] = 'k'; //fill buffer with ACK Payload

    cc1101_tx_payload_burst(my_addr, tx_addr, tx_buffer, pktlen);      //load payload to CC1101
    cc1101_transmit();                                                 //send package over the air
    cc1101_receive();                                                  //set CC1101 in cc1101_receive mode

    #if MINIMAL_MODE == 0
    if(cc1101_debug_level > 0)
    {                                        //debut output
        uart_println("Ack_send!");
    }
    #endif
}
//-------------------------------[end]------------------------------------------
//----------------------[check if Packet is received]---------------------------
uint8_t cc1101_packet_available()
{
    if(GDO2_PIN_IS_HIGH())                           //if RF package received
    {
        if(cc1101_spi_read_register(IOCFG2) == 0x06)               //if sync word detect mode is used
        {
            while(GDO2_PIN_IS_HIGH())
            {   //wait till sync word is fully received
                //uart_println("!"));
            }
        }
        return TRUE;
    }
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//------------------[check Payload for ACK or Data]-----------------------------
uint8_t cc1101_get_payload(uint8_t *rxbuffer, uint8_t *pktlen, uint8_t *my_addr,
                               uint8_t *sender, int8_t *rssi_dbm, uint8_t *lqi)
{
    uint8_t crc;

    cc1101_rx_fifo_erase(rxbuffer);                               //delete rx_fifo bufffer

    if(cc1101_rx_payload_burst(rxbuffer, pktlen) == FALSE)        //read package in buffer
    {
        cc1101_rx_fifo_erase(rxbuffer);                           //delete rx_fifo bufffer
        return FALSE;                                    //exit
    }
    else
    {
        *my_addr = rxbuffer[1];                             //set receiver address to my_addr
        *sender = rxbuffer[2];

        if(cc1101_check_acknowledge(rxbuffer, *pktlen, *sender, *my_addr) == TRUE) //acknowlage received?
        {
            cc1101_rx_fifo_erase(rxbuffer);                       //delete rx_fifo bufffer
            return FALSE;                                //Ack received -> finished
        }
        else                                               //real data, and send acknowladge
        {
            *rssi_dbm = cc1101_rssi_convert(rxbuffer[*pktlen + 1]); //converts receiver strength to dBm
            *lqi = cc1101_lqi_convert(rxbuffer[*pktlen + 2]);       //get rf quialtiy indicator
            crc = cc1101_check_crc(*lqi);                          //get packet CRC

            #if MINIMAL_MODE == 0
            if(cc1101_debug_level > 0)
            {                           //debug output messages
                if(rxbuffer[1] == BROADCAST_ADDRESS)       //if my receiver address is BROADCAST_ADDRESS
                {
                    uart_println("BROADCAST message");
                }

                uart_print("RX_FIFO:");
                for(uint8_t i = 0 ; i < *pktlen + 1; i++)   //showes rx_buffer for debug
                {
                    cc1101_uart_puthex_byte(rxbuffer[i]);
                }
                uart_print(" |");
                cc1101_uart_puthex_byte(rxbuffer[*pktlen + 1]);
                cc1101_uart_puthex_byte(rxbuffer[*pktlen + 2]);
                uart_print("|");
                uart_println("");

                uart_print("RSSI:");cc1101_uart_puti(*rssi_dbm);uart_print(" ");
                uart_print("LQI:");cc1101_uart_puthex_byte(*lqi);uart_print(" ");
                uart_print("CRC:");cc1101_uart_puthex_byte(crc);
                uart_println("");
            }
            #endif

            *my_addr = rxbuffer[1];                         //set receiver address to my_addr
            *sender = rxbuffer[2];                          //set from_sender address

