abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
            if(my_addr != BROADCAST_ADDRESS)               //send only ack if no BROADCAST_ADDRESS
            {
                cc1101_send_acknowledge(*my_addr, *sender);           //sending acknowledge to sender!
            }

            return TRUE;
        }
        return FALSE;
    }
}
//-------------------------------[end]------------------------------------------

//-------------------------[check ACKNOWLEDGE]------------------------------------
uint8_t cc1101_check_acknowledge(uint8_t *rxbuffer, uint8_t pktlen, uint8_t sender, uint8_t my_addr)
{
    int8_t rssi_dbm;
    uint8_t crc, lqi;

    if((pktlen == 0x05 && \
       (rxbuffer[1] == my_addr || rxbuffer[1] == BROADCAST_ADDRESS)) && \
        rxbuffer[2] == sender && \
        rxbuffer[3] == 'A' && rxbuffer[4] == 'c' && rxbuffer[5] == 'k') //acknowledge received!
        {
            if(rxbuffer[1] == BROADCAST_ADDRESS)
            {                           
                //if receiver address BROADCAST_ADDRESS skip acknowledge
                #if MINIMAL_MODE == 0
                if(cc1101_debug_level > 0)
                {
                    uart_println("BROADCAST ACK");
                }
                #endif
                return FALSE;
            }
            rssi_dbm = cc1101_rssi_convert(rxbuffer[pktlen + 1]);
            lqi = cc1101_lqi_convert(rxbuffer[pktlen + 2]);
            crc = cc1101_check_crc(lqi);

            #if MINIMAL_MODE == 0
            if(cc1101_debug_level > 0)
            {
                //uart_println("");
                uart_print("ACK! ");
                uart_print("RSSI:");cc1101_uart_puti(rssi_dbm);uart_print(" ");
                uart_print("LQI:");cc1101_uart_puthex_byte(lqi);uart_print(" ");
                uart_print("CRC:");cc1101_uart_puthex_byte(crc);
                uart_println("");
            }
            #endif
            return TRUE;
        }
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//------------[check if Packet is received within defined time in ms]-----------
uint8_t cc1101_wait_for_packet(uint16_t milliseconds)
{
    for(uint16_t i = 0; i < milliseconds; i++)
        {
            delay_ms(1);                 //delay_ms till system has data available
            if (cc1101_packet_available())
            {
                return TRUE;
            }
        }
    //uart_println("no packet received!"));
    return FALSE;
}
//-------------------------------[end]------------------------------------------

//--------------------------[cc1101_tx_fifo_erase]-------------------------------------
void cc1101_tx_fifo_erase(uint8_t *txbuffer)
{
    memset(txbuffer, 0, sizeof(FIFOBUFFER));  //erased the TX_fifo array content to "0"
}
//-------------------------------[end]------------------------------------------

//--------------------------[cc1101_rx_fifo_erase]-------------------------------------
void cc1101_rx_fifo_erase(uint8_t *rxbuffer)
{
    memset(rxbuffer, 0, sizeof(FIFOBUFFER)); //erased the RX_fifo array content to "0"
}
//-------------------------------[end]------------------------------------------

//------------------------[set CC1101 address]----------------------------------
void cc1101_set_myaddr(uint8_t addr)
{
    cc1101_spi_write_register(ADDR,addr);          //stores MyAddr in the CC1101
}
//-------------------------------[end]------------------------------------------

//---------------------------[set channel]--------------------------------------
void cc1101_set_channel(uint8_t channel)
{
    cc1101_spi_write_register(CHANNR,channel);   //stores the new channel # in the CC1101
}
//-------------------------------[end]------------------------------------------

//-[set modulation mode 1 = GFSK_1_2_kb; 2 = GFSK_38_4_kb; 3 = GFSK_100_kb; 4 = MSK_250_kb; 5 = MSK_500_kb; 6 = OOK_4_8_kb]-
void cc1101_set_mode(uint8_t mode)
{
    switch (mode)
    {
        case 0x01:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_GFSK_1_2_kb,CFG_REGISTER);                            //writes all 47 config register
                    break;
        #if MINIMAL_MODE == 0
        case 0x02:
                    
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_GFSK_38_4_kb,CFG_REGISTER);                            //writes all 47 config register
                    break;
        #endif
        case 0x03:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_GFSK_100_kb,CFG_REGISTER);
                    break;
        #if MINIMAL_MODE == 0
        case 0x04:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_MSK_250_kb,CFG_REGISTER);
                    break;
        #endif
        #if MINIMAL_MODE == 0
        case 0x05:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_MSK_500_kb,CFG_REGISTER);
                    break;
        #endif
        #if MINIMAL_MODE == 0
        case 0x06:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_OOK_4_8_kb,CFG_REGISTER);
                    break;
        #endif
        default:
                    cc1101_spi_write_burst(WRITE_BURST, (uint8_t*)CC1101_GFSK_1_2_kb,CFG_REGISTER);
                    mode = 0x02;
                    break;
    }
}
//-------------------------------[end]------------------------------------------

//---------[set ISM Band 1=315MHz; 2=433MHz; 3=868MHz; 4=915MHz]----------------
void cc1101_set_ISM(uint8_t ism_freq)
{
    uint8_t freq2, freq1, freq0;

    switch (ism_freq)                                                       //loads the RF freq which is defined in CC1101_freq_select
    {
        #if MINIMAL_MODE == 0
        case 0x01:                                                          //315MHz
                    freq2 = 0x0C;
                    freq1 = 0x1D;
                    freq0 = 0x89;
                    cc1101_spi_write_register(FREQ2, freq2);                                         //stores the new freq setting for defined ISM band
                    cc1101_spi_write_register(FREQ1, freq1);
                    cc1101_spi_write_register(FREQ0, freq0);
                    cc1101_spi_write_burst(PATABLE_BURST, (uint8_t*)patable_power_315, 8);                                //writes output power settings to CC1101

                    break;
        #endif
        case 0x02:                                                          //433.92MHz
                    freq2 = 0x10;
                    freq1 = 0xB0;
                    freq0 = 0x71;
                    cc1101_spi_write_register(FREQ2, freq2);                                         //stores the new freq setting for defined ISM band
                    cc1101_spi_write_register(FREQ1, freq1);
                    cc1101_spi_write_register(FREQ0, freq0);
                    cc1101_spi_write_burst(PATABLE_BURST,  (uint8_t*)patable_power_433, 8);                                //writes output power settings to CC1101

                    break;
        case 0x03:                                                          //868.3MHz
                    freq2 = 0x21;
                    freq1 = 0x65;
                    freq0 = 0x6A;
                    cc1101_spi_write_register(FREQ2, freq2);                                         //stores the new freq setting for defined ISM band
                    cc1101_spi_write_register(FREQ1, freq1);
                    cc1101_spi_write_register(FREQ0, freq0);
                    cc1101_spi_write_burst(PATABLE_BURST,  (uint8_t*)patable_power_868, 8);                                //writes output power settings to CC1101

                    break;
        #if MINIMAL_MODE == 0
        case 0x04:                                                          //915MHz
                    freq2 = 0x23;
                    freq1 = 0x31;
                    freq0 = 0x3B;
                    cc1101_spi_write_register(FREQ2, freq2);                                         //stores the new freq setting for defined ISM band
                    cc1101_spi_write_register(FREQ1, freq1);
                    cc1101_spi_write_register(FREQ0, freq0);
                    cc1101_spi_write_burst(PATABLE_BURST,  (uint8_t*)patable_power_915, 8);                                //writes output power settings to CC1101

                    break;
        #endif
        default:                                                             //default is 868.3MHz
                    freq2 = 0x21;
                    freq1 = 0x65;
                    freq0 = 0x6A;
                    cc1101_spi_write_register(FREQ2, freq2);                                         //stores the new freq setting for defined ISM band
                    cc1101_spi_write_register(FREQ1, freq1);
                    cc1101_spi_write_register(FREQ0, freq0);
                    cc1101_spi_write_burst(PATABLE_BURST,  (uint8_t*)patable_power_868, 8);                                //writes output power settings to CC1101

