abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
                    ism_freq = 0x03;
                    break;
    }
}
//-------------------------------[end]------------------------------------------

//---------------------------[set PATABLE]--------------------------------------
void cc1101_set_patable(uint8_t *patable_arr)
{
    cc1101_spi_write_burst(PATABLE_BURST, patable_arr, 8);   //writes output power settings to CC1101    "104us"
}
//-------------------------------[end]------------------------------------------

//-------------------------[set output power]-----------------------------------
void cc1101_set_output_power_level(int8_t dBm)
{
    uint8_t pa = 0xC0;

    if      (dBm <= -30) pa = 0x00;
    else if (dBm <= -20) pa = 0x01;
    else if (dBm <= -15) pa = 0x02;
    else if (dBm <= -10) pa = 0x03;
    else if (dBm <= 0)   pa = 0x04;
    else if (dBm <= 5)   pa = 0x05;
    else if (dBm <= 7)   pa = 0x06;
    else if (dBm <= 10)  pa = 0x07;

    cc1101_spi_write_register(FREND0, pa);
}
//-------------------------------[end]------------------------------------------


//-------[set Modulation type 2-FSK=0; GFSK=1; ASK/OOK=3; 4-FSK=4; MSK=7]------
#if MINIMAL_MODE == 0
void cc1101_set_modulation_type(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(MDMCFG2);
    data = (data & 0x8F) | (((cfg) << 4) & 0x70);
    cc1101_spi_write_register(MDMCFG2, data);
    //Serial.printl("MDMCFG2: 0x")
    //uart_println(data);
}
#endif
//-------------------------------[end]-----------------------------------------

//------------------------[set preamble Len]-----------------------------------
#if MINIMAL_MODE == 0
void cc1101_set_preamble_len(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(MDMCFG1);
    data = (data & 0x8F) | (((cfg) << 4) & 0x70);
    cc1101_spi_write_register(MDMCFG1, data);
    //Serial.printl("MDMCFG2: 0x");
    //uart_println(data);
}
#endif
//-------------------------------[end]-----------------------------------------

//-------------------[set modem datarate and deviant]--------------------------
#if MINIMAL_MODE == 0
void cc1101_set_datarate(uint8_t mdmcfg4, uint8_t mdmcfg3, uint8_t deviant)
{
    cc1101_spi_write_register(MDMCFG4, mdmcfg4);
    cc1101_spi_write_register(MDMCFG3, mdmcfg3);
    cc1101_spi_write_register(DEVIATN, deviant);
}
#endif
//-------------------------------[end]-----------------------------------------

//----------------------[set sync mode no sync=0;]-----------------------------
#if MINIMAL_MODE == 0
void cc1101_set_sync_mode(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(MDMCFG2);
    data = (data & 0xF8) | (cfg & 0x07);
    cc1101_spi_write_register(MDMCFG2, data);
    //uart_println("MDMCFG2: 0x%02X\n", data);
}
#endif
//-------------------------------[end]-----------------------------------------

//---------------[set FEC ON=TRUE; OFF=FALSE]----------------------------------
#if MINIMAL_MODE == 0
void cc1101_set_fec(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(MDMCFG1);
    data = (data & 0x7F) | (((cfg) << 7) & 0x80);
    cc1101_spi_write_register(MDMCFG1, data);
    uart_print("MDMCFG1: 0x");
    cc1101_uart_puti(data);
}
#endif
//-------------------------------[end]------------------------------------------

//---------------[set data_whitening ON=TRUE; OFF=FALSE]------------------------
#if MINIMAL_MODE == 0
void cc1101_set_data_whitening(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(PKTCTRL0);
    data = (data & 0xBF) | (((cfg) << 6) & 0x40);
    cc1101_spi_write_register(PKTCTRL0, data);
    //uart_print("PKTCTRL0: 0x");
    //uart_println(data);
}
#endif
//-------------------------------[end]-----------------------------------------

//------------[set manchester encoding ON=TRUE; OFF=FALSE]---------------------
#if MINIMAL_MODE == 0
void cc1101_set_manchester_encoding(uint8_t cfg)
{
    uint8_t data;
    data = cc1101_spi_read_register(MDMCFG2);
    data = (data & 0xF7) | (((cfg) << 3) & 0x08);
    cc1101_spi_write_register(MDMCFG2, data);
    //uart_print("MDMCFG2: 0x");
    //uart_println(data);
}
#endif
//-------------------------------[end]------------------------------------------

//--------------------------[cc1101_rssi_convert]--------------------------------------
int8_t cc1101_rssi_convert(uint8_t Rssi_hex)
{
    int8_t rssi_dbm = 0;
    int16_t Rssi_dec = 0;

    Rssi_dec = Rssi_hex;        //convert unsigned to signed

    if (Rssi_dec >= 128)
    {
        rssi_dbm = ((Rssi_dec - 256) / 2) - RSSI_OFFSET_868MHZ;
    }
    else
    {
        if (Rssi_dec < 128)
        {
            rssi_dbm = ((Rssi_dec) / 2) - RSSI_OFFSET_868MHZ;
        }
    }
    return rssi_dbm;
}
//-------------------------------[end]------------------------------------------

//----------------------------[lqi convert]-------------------------------------
uint8_t cc1101_lqi_convert(uint8_t lqi)
{
    return (lqi & 0x7F);
}
//-------------------------------[end]------------------------------------------

//----------------------------[check crc]---------------------------------------
uint8_t cc1101_check_crc(uint8_t lqi)
{
    return (lqi & 0x80);
}
//-------------------------------[end]------------------------------------------


//----------------------------[get temp]----------------------------------------
#if MINIMAL_MODE == 0
uint8_t cc1101_get_temp(uint8_t *ptemp_Arr)
{
    // const uint8_t num_samples = 8;
    // uint16_t adc_result = 0;
    // uint32_t temperature = 0;

    // cc1101_sidle();                              //sets CC1100 into IDLE
    // cc1101_spi_write_register(PTEST, 0xBF);       //enable temp sensor
    // delay_ms(50);                            //wait a bit

    // for(uint8_t i = 0; i < num_samples; i++)    //sampling analog temperature value
    // {
    //     adc_result += analogRead(GDO0);
    //     delay_ms(1);
    // }
    // adc_result = adc_result / num_samples;
    // //uart_println(adc_result);

    // temperature = (adc_result * CC1101_TEMP_ADC_MV) / CC1101_TEMP_CELS_CO;

    // ptemp_Arr[0] = temperature / 10;      //cut last digit
    // ptemp_Arr[1] = temperature % 10;      //isolate last digit

    // if(cc1101_debug_level > 0){
    //     uart_print("Temp:");uart_print(ptemp_Arr[0]);uart_print(".");uart_println(ptemp_Arr[1]);
    // }

