abhra0897/stm8s_cc1101/lib/src/stm8_cc1101.c
    // cc1101_spi_write_register(PTEST,0x7F);       //writes 0x7F back to PTest (app. note)

    // cc1101_receive();
    // return (*ptemp_Arr);
    ptemp_Arr[0] = 0;
    ptemp_Arr[1] = 0;
    return 0;
}
#endif
//-------------------------------[end]------------------------------------------


//|==================== SPI Initialisation for CC1101 =========================|
void cc1101_spi_begin(void)
{
   /* configure SPI */
    spi_config();
    spi_cs_idle();
}
//-------------------------------[end]------------------------------------------

void cc1101_GDO_set()
{
    CONFIG_GDO0_PIN_AS_INPUT();
	CONFIG_GDO2_PIN_AS_INPUT();
}


//|==================== SPI Initialisation for CC1101 =========================|

void cc1101_spi_end(void)
{
    /// Not needed, so unimplemented
    /// Kept here for compatibility purpose
	return;
}
//-------------------------------[end]------------------------------------------



//|============================= SPI Transmission =============================|
uint8_t cc1101_spi_putc(uint8_t data)
{

    SPI_WRITE_BYTE(data);
    spi_busy_wait();
    uint8_t statusByte = SPI_READ_BYTE();

    return statusByte;
}
//|==================== schreibe strobe command  ==============================|
void cc1101_spi_write_strobe(uint8_t spi_instr)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  // Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr);
    SPI_CS_IDLE();         // CS high
}
//|======================= Read status byte ==================================|
/*
uint8_t cc1101_spi_read_status(uint8_t spi_instr)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  // Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr | Read_burst);
    spi_instr = cc1101_spi_putc(0xFF);
    SPI_CS_IDLE();         // CS high

    return spi_instr;
}
*/
//|========================== Read registers ==============================|
uint8_t cc1101_spi_read_register(uint8_t spi_instr)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  // Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr | READ_SINGLE_BYTE);
    spi_instr = cc1101_spi_putc(0xFF);
    SPI_CS_IDLE();         // CS high

    return spi_instr;
}
//|========== Read multiple registers in burst mode ========|
void cc1101_spi_read_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  //Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr | READ_BURST);

    for(uint8_t i=0; i<length; i++)
        {
            pArr[i] = cc1101_spi_putc(0xFF);
        }

    SPI_CS_IDLE();
}
//|======================= Write registers =============================|
void cc1101_spi_write_register(uint8_t spi_instr, uint8_t value)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  //Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr | WRITE_SINGLE_BYTE);
    cc1101_spi_putc(value);
    SPI_CS_IDLE();
}
//|======= Write multiple registers in burst mode =======|
void cc1101_spi_write_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_CS_ACTIVE();          // CS low
    while (SPI_SO_PIN_IS_HIGH());  //Wait until SO becomes LOW
    cc1101_spi_putc(spi_instr | WRITE_BURST);

    for(uint8_t i=0; i<length ;i++)
    {
        cc1101_spi_putc(pArr[i]);
    }

    SPI_CS_IDLE();
}
//|=================================== END ====================================|


//|=========================== UART helper ====================================|

/*******************************************************************************
Function: cc1101_uart_puthex_nibble()
Purpose:  cc1101_transmit lower nibble as ASCII-hex to UART
Input:    byte value
Returns:  none
This functions has been added by Martin Thomas <eversmith@heizung-thomas.de>
Don't blame P. Fleury if it doesn't work ;-)
*******************************************************************************/
void cc1101_uart_puthex_nibble(const unsigned char b)
{
    unsigned char  c = b & 0x0f;
    if (c>9) c += 'A'-10;
    else c += '0';
    uart_write_byte(c);                  //uart_putc replaced to Serial.write
} /* cc1101_uart_puthex_nibble */

/*******************************************************************************
Function: cc1101_uart_puthex_byte()
Purpose:  cc1101_transmit upper and lower nibble as ASCII-hex to UART
Input:    byte value
Returns:  none
This functions has been added by Martin Thomas <eversmith@heizung-thomas.de>
Don't blame P. Fleury if it doesn't work ;-)
*******************************************************************************/
void cc1101_uart_puthex_byte(const unsigned char b)
{
    cc1101_uart_puthex_nibble(b>>4);
    cc1101_uart_puthex_nibble(b);
} /* cc1101_uart_puthex_byte */

/*******************************************************************************
Function: cc1101_uart_puti()
Purpose:  cc1101_transmit integer as ASCII to UART
Input:    integer value
Returns:  none
This functions has been added by Martin Thomas <eversmith@heizung-thomas.de>
Don't blame P. Fleury if it doesn't work ;-)
*******************************************************************************/
void cc1101_uart_puti(const int val)
{
    uart_printnum(val, 10);

}/* cc1101_uart_puti */
//|================================= END ======================================|
